# Homebrew Bundle file for nehalecky's dotfiles
# Install with: brew bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Core Development Tools
brew "git"                    # Version control
brew "gh"                     # GitHub CLI
brew "docker", link: false    # Containerization
brew "node"                   # JavaScript runtime
brew "jq"                     # JSON processor

# Python Development
brew "pdm"                    # Python dependency manager

# Terminal & Shell
brew "zsh"                    # Z shell
brew "bash"                   # Bash (macOS version is old)
brew "starship"               # Modern prompt
brew "chezmoi"                # Dotfiles manager

# Terminal Utilities
brew "bat"                    # Better cat with syntax highlighting
brew "eza"                    # Better ls with colors/icons
brew "ripgrep"                # Fast grep
brew "fzf"                    # Fuzzy finder
brew "glow"                   # Markdown renderer
brew "tealdeer"               # tldr pages
brew "btop"                   # Resource monitor
brew "wget"                   # File downloader

# Development Utilities
brew "emacs", restart_service: :changed  # Text editor
brew "cosign"                 # Container signing
brew "flux", link: false      # GitOps tool

# AI & Utilities
brew "llm"                    # LLM CLI tool
brew "speedtest-cli"          # Internet speed test

# Security & Authentication (Casks)
cask "1password"              # Password manager
cask "1password-cli"          # 1Password CLI
cask "gpg-suite"              # GPG tools

# Development Tools (Casks)
cask "docker"                 # Docker Desktop
cask "iterm2"                 # Terminal emulator
cask "visual-studio-code"     # Code editor
cask "cursor"                 # AI-powered code editor
cask "miniconda"              # Python environment manager
cask "julia"                  # Scientific computing

# Productivity & Notes
cask "obsidian"               # Note-taking
cask "raycast"                # Productivity launcher
cask "zotero"                 # Reference manager

# Communication
cask "slack"                  # Team communication
cask "signal"                 # Secure messaging
cask "telegram"               # Messaging
cask "whatsapp"               # Messaging
cask "zoom"                   # Video conferencing

# Browsers
cask "arc"                    # Modern browser
cask "firefox"                # Web browser

# Media & Entertainment
cask "spotify"                # Music streaming
cask "vlc"                    # Media player
cask "sonic-pi"               # Music programming

# Utilities
cask "claude"                 # Claude desktop app
cask "protonvpn"              # VPN client
cask "garmin-express"         # Garmin device sync
cask "openmtp"                # Android file transfer
cask "font-awesome-terminal-fonts"  # Terminal fonts

# Optional/Gaming
cask "steam"                  # Gaming platform
cask "pokemon-trading-card-game-online"  # Pokemon TCG
cask "github"                 # GitHub Desktop
cask "qr-journal"             # QR code tool
cask "texshop"                # LaTeX editor

# VS Code Extensions
vscode "davidanson.vscode-markdownlint"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "yzhang.markdown-all-in-one"
