tap "romkatv/powerlevel10k"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Container Signing
brew "cosign"
# GNU Emacs text editor
brew "emacs", restart_service: :changed
# Modern, maintained replacement for ls
brew "eza"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Lightweight scripting language for querying databases
brew "flux", link: false
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Access large language models from the command-line
brew "llm"
# Platform built on V8 to build network applications
brew "node"
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Chromium based browser
cask "arc"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Web browser
cask "firefox"
cask "font-awesome-terminal-fonts"
# Nerd Font specifically patched for Powerlevel10k
cask "font-meslo-for-powerlevel10k"
# Update maps and software, sync with Garmin Connect and register your device
# cask "garmin-express" # Requires manual installation due to sudo requirement
# Desktop client for GitHub repositories
cask "github"
# Tools to protect your emails and files
# cask "gpg-suite" # Requires manual installation due to sudo requirement
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# Play the Pokémon Trading Card Game
cask "pokemon-tcg-live"
# Play the Pokemon TCG online
# cask "pokemon-trading-card-game-online" # No longer available in Homebrew
# VPN client focusing on security
cask "protonvpn"
# Allows users with an iSight (or compatible) camera to read QR codes
cask "qr-journal"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Code-based music creation and performance tool
cask "sonic-pi"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# LaTeX and TeX editor and previewer
cask "texshop"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "davidanson.vscode-markdownlint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "yzhang.markdown-all-in-one"
